llm/ernie_45/b200/bench/bench_sharegpt_mid.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot-llm-interface/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='baidu/ERNIE-4.5-21B-A3B-PT', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=8, sharegpt_context_len=8192, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot-llm-interface/llm/ernie_45/b200/bench/sharegpt_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot-llm-interface/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='baidu/ERNIE-4.5-21B-A3B-PT', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=8, sharegpt_context_len=8192, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot-llm-interface/llm/ernie_45/b200/bench/sharegpt_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 11304
#Output tokens: 256
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  4.20      
Total input tokens:                      11304     
Total input text tokens:                 11304     
Total generated tokens:                  256       
Total generated tokens (retokenized):    251       
Request throughput (req/s):              7.62      
Input token throughput (tok/s):          2690.22   
Output token throughput (tok/s):         60.93     
Peak output token throughput (tok/s):    96.00     
Peak concurrent requests:                32        
Total token throughput (tok/s):          2751.15   
Concurrency:                             31.92     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   4191.07   
Median E2E Latency (ms):                 4191.06   
P90 E2E Latency (ms):                    4191.76   
P99 E2E Latency (ms):                    4192.64   
---------------Time to First Token----------------
Mean TTFT (ms):                          1200.76   
Median TTFT (ms):                        1174.10   
P99 TTFT (ms):                           1604.17   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          427.19    
Median TPOT (ms):                        431.00    
P99 TPOT (ms):                           474.32    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           432.99    
Median ITL (ms):                         430.52    
P95 ITL (ms):                            434.31    
P99 ITL (ms):                            434.55    
Max ITL (ms):                            869.67    
==================================================